# RbsElecEditCircuitNamingSettingsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecEditCircuitNamingSettingsParam Property
ParameterTypeId Class See Also
---
"Circuit Naming Settings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecEditCircuitNamingSettingsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecEditCircuitNamingSettingsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecEditCircuitNamingSettingsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace